arduino/Arduino/hardware/msp430/cores/msp430/wiring_analog.c
/*
  ************************************************************************
  *	wiring_analog.c
  *
  *	Arduino core files for MSP430
  *		Copyright (c) 2012 Robert Wessels. All right reserved.
  *
  *
  ***********************************************************************
  Derived from:
  wiring_analog.c - analog input and output
  Part of Arduino - http://www.arduino.cc/

  Copyright (c) 2005-2006 David A. Mellis

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General
  Public License along with this library; if not, write to the
  Free Software Foundation, Inc., 59 Temple Place, Suite 330,
  Boston, MA  02111-1307  USA
*/

#include "wiring_private.h"
#include "pins_energia.h"

#if defined(__MSP430_HAS_ADC10__) && !defined(ADC10ENC)
#define ADC10ENC ENC 
#endif
#if defined(__MSP430_HAS_ADC10__)
#define ADCxMEM0 ADC10MEM 
#endif
#if defined(__MSP430_HAS_ADC10_A__)
#define ADCxMEM0 ADC10MEM 
#endif
#if defined(__MSP430_HAS_ADC10_B__)
#define REFV_MASK 0x70
#define REF_MASK 0x31
#define ADCxMEM0 ADC10MEM0 
#endif
#if defined(__MSP430_HAS_ADC12_PLUS__)
#define REFV_MASK 0x0070
#define REF_MASK 0xB1
#define ADCxMEM0 ADC12MEM0 
#endif
#if defined(__MSP430_HAS_ADC12_B__)
#define REFV_MASK 0x0F00
#define REF_MASK 0x31
#define ADCxMEM0 ADC12MEM0 
#endif

#if defined(__MSP430_HAS_ADC10__) || defined(__MSP430_HAS_ADC10_B__) || defined(__MSP430_HAS_ADC12_PLUS__) || defined(__MSP430_HAS_ADC12_B__)
uint16_t analog_reference = DEFAULT;

void analogReference(uint16_t mode)
{
	// can't actually set the register here because the default setting
	// will connect AVCC and the AREF pin, which would cause a short if
	// there's something connected to AREF.
	analog_reference = mode;
}
#endif

uint16_t analog_period = F_CPU/490, analog_div = ID_0, analog_res = 255;

//TODO: Can be a lot more efficiant.
//      - lower clock rated / input devider to conserve Energia.
//      - pin configuration logic.

// Note set frequency before sending analog value
// Lowest fequency is defined by clock frequency F_CPU, and max counter value 2^16-1
// fmin = F_CPU / 2^16
void analogFrequency(uint32_t freq)
{
	if ( freq <= F_CPU/(8*65334L) ) {
		return;  // Out of luck, sorry pal.
	}

	if ( freq <= F_CPU/(4*65334L) ) {
		analog_div = ID_3;
		freq *= 8;
	} else if ( freq <= F_CPU/(2*65334L) ) {
		analog_div = ID_2;
		freq *= 4;
	} else if ( freq <= F_CPU/(1*65334L) ) {
		analog_div = ID_1;
		freq *= 2;
	} else {
		analog_div = ID_0;
	}
	analog_period = F_CPU/freq;
}

// Set the resulution (nr of counts for 100%), default = 255, large values may not work at all frequencies
void analogResolution(uint16_t res)
{
	analog_res = res;
}

/* Timer_A delayed-CCR-update ISRs. */

#if defined(__MSP430_HAS_TA2__) || defined(__MSP430_HAS_T0A2__)
volatile uint16_t timera0_ccr_dblbuf[1];
__attribute__((interrupt(TIMER0_A0_VECTOR)))
void TA0_CCR_updater()
{
	TA0CCR1 = timera0_ccr_dblbuf[0];
	TA0CCTL0 &= ~CCIE;
}
#endif

#if defined(__MSP430_HAS_TA3__) || defined(__MSP430_HAS_T0A3__)
volatile uint16_t timera0_ccr_dblbuf[2];
__attribute__((interrupt(TIMER0_A0_VECTOR)))
void TA0_CCR_updater()
{
	TA0CCR1 = timera0_ccr_dblbuf[0];
	TA0CCR2 = timera0_ccr_dblbuf[1];
	TA0CCTL0 &= ~CCIE;
}
#endif

#if defined(__MSP430_HAS_TA5__) || defined(__MSP430_HAS_T0A5__) 
volatile uint16_t timera0_ccr_dblbuf[4];
__attribute__((interrupt(TIMER0_A0_VECTOR)))
void TA0_CCR_updater()
{
	TA0CCR1 = timera0_ccr_dblbuf[0];
	TA0CCR2 = timera0_ccr_dblbuf[1];
	TA0CCR3 = timera0_ccr_dblbuf[2];
	TA0CCR4 = timera0_ccr_dblbuf[3];
	TA0CCTL0 &= ~CCIE;
}
#endif

#if defined(__MSP430_HAS_T1A3__) 
volatile uint16_t timera1_ccr_dblbuf[2];
__attribute__((interrupt(TIMER1_A0_VECTOR)))
void TA1_CCR_updater()
{
	TA1CCR1 = timera1_ccr_dblbuf[0];
	TA1CCR2 = timera1_ccr_dblbuf[1];
	TA1CCTL0 &= ~CCIE;
}
#endif

#if defined(__MSP430_HAS_T2A3__)  
volatile uint16_t timera2_ccr_dblbuf[2];
__attribute__((interrupt(TIMER2_A0_VECTOR)))
void TA2_CCR_updater()
{
	TA2CCR1 = timera2_ccr_dblbuf[0];
	TA2CCR2 = timera2_ccr_dblbuf[1];
	TA2CCTL0 &= ~CCIE;
}
#endif

/* MSP430's with Port Mappers (F5xxx series, etc) need the correct Port Mapping ID for their timers. */
#if defined(__MSP430_HAS_PORT_MAPPING__)
extern const uint8_t pmap_timer_ids[];
#endif


//Arduino specifies ~490 Hz for analog out PWM so we follow suit.
#define PWM_PERIOD analog_period // F_CPU/490
#define PWM_DUTY(x) ( (unsigned long)x*PWM_PERIOD / (unsigned long)analog_res )

void analogWrite(uint8_t pin, int val)
{
 	if (val == 0)
	{
		pinMode(pin, OUTPUT);
		digitalWrite(pin, LOW); // set pin to LOW when duty cycle is 0
                                        // digitalWrite will take care of invalid pins
	}
	else if (val == analog_res)
	{
		pinMode(pin, OUTPUT);
		digitalWrite(pin, HIGH); // set pin HIGH when duty cycle is 255
                                         // digitalWrite will take care of invalid pins
	}
	else
	{

	        uint8_t bit = digitalPinToBitMask(pin); // get pin bit
	        uint8_t port = digitalPinToPort(pin);   // get pin port
	        volatile uint8_t *sel;
                
                if (port == NOT_A_PORT) return; // pin on timer?

	        sel = portSelRegister(port); // get the port function select register address
		uint16_t is_already_pwm = false;  // uint16_t is fine since this gets optimized away using a register anyhow

#if (defined(P1SEL2_) || defined(P1SEL2))
#define is_using_two_pxsel
		volatile uint8_t *selx = portSel2Register(port);
#endif
#if (defined(P1SEL1_) || defined(P1SEL1))
#define is_using_two_pxsel
		volatile uint8_t *selx = portSel1Register(port);
#endif

#ifdef is_using_two_pxsel
#define SET_PXSEL(bit) *sel |= bit; *selx &= ~bit
#else
#define SET_PXSEL(bit) *sel |= bit
#endif

