arduino/Arduino/hardware/msp430/cores/msp430/wiring_analog.c
		uint8_t timerID = digitalPinToTimer(pin);
		#if defined(__MSP430_HAS_PORT_MAPPING__)
		uint16_t pmapID = (uint16_t)pmap_timer_ids[timerID] << 8;
		#else
		#define pmapID 0
		#endif

		#ifdef is_using_two_pxsel
		if ( (*sel & bit) && !(*selx & bit) ) {
		#else
		if (*sel & bit) {
		#endif
			is_already_pwm = true;
		} else {
			pinMode_int(pin, OUTPUT | pmapID);  // Get PxDIR set
		}

		uint16_t ccrval = PWM_DUTY(val);  // get the 32-bit math done early

		switch(timerID) {                // which timer and CCR?
 			//case: T0A0                            // CCR0 used as period register
			case T0A1:                              // TimerA0 / CCR1
				if (!is_already_pwm) {
					TA0CCR0 = PWM_PERIOD;           // PWM Period
					TA0CCTL1 = OUTMOD_7;            // reset/set
					TA0CCR1 = ccrval;       // PWM duty cycle
					timera0_ccr_dblbuf[0] = ccrval;
					SET_PXSEL(bit);
					TA0CTL = TASSEL_2 | MC_1 | analog_div;       // SMCLK, up mode
				} else {
					timera0_ccr_dblbuf[0] = ccrval;
					TA0CCTL0 &= ~CCIFG;
					TA0CCTL0 |= CCIE;
				}
                                break;
#if defined(__MSP430_HAS_TA3__) || defined(__MSP430_HAS_T0A3__) || defined(__MSP430_HAS_T0A5__) || defined(__MSP430_HAS_TA5__) 
 			case T0A2:                              // TimerA0 / CCR2
				if (!is_already_pwm) {
					TA0CCR0 = PWM_PERIOD;           // PWM Period
					TA0CCTL2 = OUTMOD_7;            // reset/set
					TA0CCR2 = ccrval;       // PWM duty cycle
					timera0_ccr_dblbuf[1] = ccrval;
					SET_PXSEL(bit);
					TA0CTL = TASSEL_2 | MC_1 | analog_div;       // SMCLK, up mode
				} else {
					timera0_ccr_dblbuf[1] = ccrval;
					TA0CCTL0 &= ~CCIFG;
					TA0CCTL0 |= CCIE;
				}
                                break;
#endif
#if defined(__MSP430_HAS_TA5__) || defined(__MSP430_HAS_T0A5__) 
 			case T0A3:                              // TimerA0 / CCR3
				if (!is_already_pwm) {
					TA0CCR0 = PWM_PERIOD;           // PWM Period
					TA0CCTL3 = OUTMOD_7;            // reset/set
					TA0CCR3 = ccrval;       // PWM duty cycle
					timera0_ccr_dblbuf[2] = ccrval;
					SET_PXSEL(bit);
					TA0CTL = TASSEL_2 | MC_1 | analog_div;       // SMCLK, up mode
				} else {
					timera0_ccr_dblbuf[2] = ccrval;
					TA0CCTL0 &= ~CCIFG;
					TA0CCTL0 |= CCIE;
				}
                                break;
 			case T0A4:                              // TimerA0 / CCR4
				if (!is_already_pwm) {
					TA0CCR0 = PWM_PERIOD;           // PWM Period
					TA0CCTL4 = OUTMOD_7;            // reset/set
					TA0CCR4 = ccrval;       // PWM duty cycle
					timera0_ccr_dblbuf[3] = ccrval;
					SET_PXSEL(bit);
					TA0CTL = TASSEL_2 | MC_1 | analog_div;       // SMCLK, up mode
				} else {
					timera0_ccr_dblbuf[3] = ccrval;
					TA0CCTL0 &= ~CCIFG;
					TA0CCTL0 |= CCIE;
				}
                                break;
#endif
#if defined(__MSP430_HAS_T1A3__) 
 			//case: T1A0                            // CCR0 used as period register
			case T1A1:                              // TimerA1 / CCR1
				if (!is_already_pwm) {
					TA1CCR0 = PWM_PERIOD;           // PWM Period
					TA1CCTL1 = OUTMOD_7;            // reset/set
					TA1CCR1 = ccrval;       // PWM duty cycle
					timera1_ccr_dblbuf[0] = ccrval;
					SET_PXSEL(bit);
					TA1CTL = TASSEL_2 | MC_1 | analog_div;       // SMCLK, up mode
				} else {
					timera1_ccr_dblbuf[0] = ccrval;
					TA1CCTL0 &= ~CCIFG;
					TA1CCTL0 |= CCIE;
				}
                                break;
 			case T1A2:                              // TimerA1 / CCR2
				if (!is_already_pwm) {
					TA1CCR0 = PWM_PERIOD;           // PWM Period
					TA1CCTL2 = OUTMOD_7;            // reset/set
					TA1CCR2 = ccrval;       // PWM duty cycle
					timera1_ccr_dblbuf[1] = ccrval;
					SET_PXSEL(bit);
					TA1CTL = TASSEL_2 | MC_1 | analog_div;       // SMCLK, up mode
				} else {
					timera1_ccr_dblbuf[1] = ccrval;
					TA1CCTL0 &= ~CCIFG;
					TA1CCTL0 |= CCIE;
				}
                                break;
#endif
#if defined(__MSP430_HAS_T2A3__)  
 			//case: T2A0                            // CCR0 used as period register
			case T2A1:                              // TimerA2 / CCR1
				if (!is_already_pwm) {
					TA2CCR0 = PWM_PERIOD;           // PWM Period
					TA2CCTL1 = OUTMOD_7;            // reset/set
					TA2CCR1 = ccrval;       // PWM duty cycle
					timera2_ccr_dblbuf[0] = ccrval;
					SET_PXSEL(bit);
					TA2CTL = TASSEL_2 | MC_1 | analog_div;       // SMCLK, up mode
				} else {
					timera2_ccr_dblbuf[0] = ccrval;
					TA2CCTL0 &= ~CCIFG;
					TA2CCTL0 |= CCIE;
				}
                                break;
 			case T2A2:                              // TimerA2 / CCR2
				if (!is_already_pwm) {
					TA2CCR0 = PWM_PERIOD;           // PWM Period
					TA2CCTL2 = OUTMOD_7;            // reset/set
					TA2CCR2 = ccrval;       // PWM duty cycle
					timera2_ccr_dblbuf[1] = ccrval;
					SET_PXSEL(bit);
					TA2CTL = TASSEL_2 | MC_1 | analog_div;       // SMCLK, up mode
				} else {
					timera2_ccr_dblbuf[1] = ccrval;
					TA2CCTL0 &= ~CCIFG;
					TA2CCTL0 |= CCIE;
				}
                                break;
#endif
#if defined(__MSP430_HAS_TB3__) || defined(__MSP430_HAS_T0B3__) || defined(__MSP430_HAS_TB7__) || defined(__MSP430_HAS_T0B7__) 
 			//case: T0B0                            // CCR0 used as period register
 			case T0B1:                              // TimerB0 / CCR1
				if (!is_already_pwm) {
					TB0CCR0 = PWM_PERIOD;           // PWM Period
					TB0CCTL1 = OUTMOD_7 | CLLD_0;   // reset/set, CCR updates immediately on initial setting
					TB0CCR1 = ccrval;       // PWM duty cycle
					SET_PXSEL(bit);
					TB0CCTL1 |= CLLD_2; // Future CCR updates will be double-buffered
					TB0CTL = TBSSEL_2 | MC_1 | analog_div;       // SMCLK, up mode
				} else {
					TB0CCR1 = ccrval;       // PWM duty cycle
				}
                                break;
 			case T0B2:                              // TimerB0 / CCR1
				if (!is_already_pwm) {
					TB0CCR0 = PWM_PERIOD;           // PWM Period
					TB0CCTL2 = OUTMOD_7 | CLLD_0;   // reset/set, CCR updates immediately on initial setting
					TB0CCR2 = ccrval;       // PWM duty cycle
					SET_PXSEL(bit);
					TB0CCTL2 |= CLLD_1; // Future CCR updates will be double-buffered
					TB0CTL = TBSSEL_2 | MC_1 | analog_div;       // SMCLK, up mode
				} else {
					TB0CCR2 = ccrval;       // PWM duty cycle
				}
                                break;
#endif
#if defined(__MSP430_HAS_TB7__) || defined(__MSP430_HAS_T0B7__) 
 			case T0B3:                              // TimerB0 / CCR3
				if (!is_already_pwm) {
					TB0CCR0 = PWM_PERIOD;           // PWM Period
					TB0CCTL3 = OUTMOD_7 | CLLD_0;   // reset/set, CCR updates immediately on initial setting
					TB0CCR3 = ccrval;       // PWM duty cycle
					SET_PXSEL(bit);
					TB0CCTL3 |= CLLD_1; // Future CCR updates will be double-buffered
					TB0CTL = TBSSEL_2 | MC_1 | analog_div;       // SMCLK, up mode
				} else {
					TB0CCR3 = ccrval;       // PWM duty cycle
				}
                                break;
 			case T0B4:                              // TimerB0 / CCR4
				if (!is_already_pwm) {
					TB0CCR0 = PWM_PERIOD;           // PWM Period
					TB0CCTL4 = OUTMOD_7 | CLLD_0;   // reset/set, CCR updates immediately on initial setting
					TB0CCR4 = ccrval;       // PWM duty cycle
					SET_PXSEL(bit);
					TB0CCTL4 |= CLLD_1; // Future CCR updates will be double-buffered
					TB0CTL = TBSSEL_2 | MC_1 | analog_div;       // SMCLK, up mode
				} else {
					TB0CCR4 = ccrval;       // PWM duty cycle
				}
                                break;
 			case T0B5:                              // TimerB0 / CCR5
				if (!is_already_pwm) {
					TB0CCR0 = PWM_PERIOD;           // PWM Period
					TB0CCTL5 = OUTMOD_7 | CLLD_0;   // reset/set, CCR updates immediately on initial setting
					TB0CCR5 = ccrval;       // PWM duty cycle
					SET_PXSEL(bit);
					TB0CCTL5 |= CLLD_1; // Future CCR updates will be double-buffered
					TB0CTL = TBSSEL_2 | MC_1 | analog_div;       // SMCLK, up mode
				} else {
					TB0CCR5 = ccrval;       // PWM duty cycle
				}
                                break;
 			case T0B6:                              // TimerB0 / CCR6
				if (!is_already_pwm) {
					TB0CCR0 = PWM_PERIOD;           // PWM Period
					TB0CCTL6 = OUTMOD_7 | CLLD_0;   // reset/set, CCR updates immediately on initial setting
					TB0CCR6 = ccrval;       // PWM duty cycle
					SET_PXSEL(bit);
					TB0CCTL6 |= CLLD_1; // Future CCR updates will be double-buffered
					TB0CTL = TBSSEL_2 | MC_1 | analog_div;       // SMCLK, up mode
				} else {
					TB0CCR6 = ccrval;       // PWM duty cycle
				}
                                break;
#endif
#if defined(__MSP430_HAS_T1B3__) 
 			//case: T1B0                            // CCR0 used as period register
 			case T1B1:                              // TimerB0 / CCR1
				if (!is_already_pwm) {
					TB1CCR0 = PWM_PERIOD;           // PWM Period
					TB1CCTL1 = OUTMOD_7 | CLLD_0;   // reset/set, CCR updates immediately on initial setting
					TB1CCR1 = ccrval;       // PWM duty cycle
					SET_PXSEL(bit);
					TB1CCTL1 |= CLLD_1; // Future CCR updates will be double-buffered
					TB1CTL = TBSSEL_2 | MC_1 | analog_div;       // SMCLK, up mode
				} else {
					TB1CCR1 = ccrval;       // PWM duty cycle
				}
                                break;
 			case T1B2:                              // TimerB0 / CCR1
				if (!is_already_pwm) {
					TB1CCR0 = PWM_PERIOD;           // PWM Period
					TB1CCTL2 = OUTMOD_7 | CLLD_0;   // reset/set, CCR updates immediately on initial setting
					TB1CCR2 = ccrval;       // PWM duty cycle
					SET_PXSEL(bit);
					TB1CCTL2 |= CLLD_1; // Future CCR updates will be double-buffered
					TB1CTL = TBSSEL_2 | MC_1 | analog_div;       // SMCLK, up mode
				} else {
					TB1CCR2 = ccrval;       // PWM duty cycle
				}
                                break;
#endif
#if defined(__MSP430_HAS_T2B3__) 
 			//case: T1B0                            // CCR0 used as period register
 			case T2B1:                              // TimerB0 / CCR1
				if (!is_already_pwm) {
					TB2CCR0 = PWM_PERIOD;           // PWM Period
					TB2CCTL1 = OUTMOD_7 | CLLD_0;   // reset/set, CCR updates immediately on initial setting
					TB2CCR1 = ccrval;       // PWM duty cycle
					SET_PXSEL(bit);
					TB2CCTL1 |= CLLD_1; // Future CCR updates will be double-buffered
					TB2CTL = TBSSEL_2 | MC_1 | analog_div;       // SMCLK, up mode
				} else {
					TB2CCR1 = ccrval;       // PWM duty cycle
				}
                                break;
 			case T2B2:                              // TimerB0 / CCR1
				if (!is_already_pwm) {
					TB2CCR0 = PWM_PERIOD;           // PWM Period
					TB2CCTL2 = OUTMOD_7 | CLLD_0;   // reset/set, CCR updates immediately on initial setting
					TB2CCR2 = ccrval;       // PWM duty cycle
					SET_PXSEL(bit);
					TB2CCTL2 |= CLLD_1; // Future CCR updates will be double-buffered
					TB2CTL = TBSSEL_2 | MC_1 | analog_div;       // SMCLK, up mode
				} else {
					TB2CCR2 = ccrval;       // PWM duty cycle
				}
                                break;
#endif
 
                        case NOT_ON_TIMER:                      // not on a timer output pin
			default:                                // or TxA0 pin
				pinMode(pin, OUTPUT);
				if (val <= (analog_res >> 1)) {
					digitalWrite(pin, LOW); // 
				} else {
					digitalWrite(pin, HIGH);
				}
                }
        }
}


uint16_t analogRead(uint8_t pin)
{
// make sure we have an ADC
	uint8_t channel;
	
	// Check if pin is valid
	if (pin==NOT_ON_ADC)
		return 0;
	// Check if pin is a special analog pin (A10 = temp sensor, A11 = Vcc/2, etc.)
	if (pin >=128)
		channel = pin - 128;
	else
		channel = digitalPinToADCIn(pin);
	
#if defined(__MSP430_HAS_ADC10__) || defined(__MSP430_HAS_ADC10_B__) || defined(__MSP430_HAS_ADC12_PLUS__) || defined(__MSP430_HAS_ADC12_B__)
    //  0000 A0
    //  0001 A1
    //  0010 A2
    //  0011 A3
    //  0100 A4
    //  0101 A5
    //  0110 A6
    //  0111 A7
    //  1010 Internal temperature sensor

